# IsValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationItemFile..::..IsValid Method
FabricationItemFile Class See Also
---
Checks to see if the item file is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
Returns true if the item file is valid, false otherwise.
# See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace